In [1]:
import pandas as pd

# Question No. - (1)

In [9]:
series_1 = pd.Series([4, 8, 15, 16, 23, 42])

In [10]:
type(series_1)

pandas.core.series.Series

In [11]:
series_1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

# Question No. - (2)

In [12]:
variable_list = list(range(10))

In [14]:
series_2 = pd.Series(variable_list)

In [16]:
series_2  # 10 elements are in this series

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

# Question No. - (3)

In [22]:
df = pd.DataFrame({
    'Name' : ['Alice', 'Bob', 'Claire'],
    'Age': [25, 30, 27],
    'Gender' : ['Female', 'Male','Female']
})

In [23]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [24]:
type(df)

pandas.core.frame.DataFrame

# Question No. - (4)

DataFrame - is like a tabular format of data or can say dictionary of series

In [26]:
df1 = pd.DataFrame({
    'Name' : ['Alice', 'Bob', 'Claire'],
    'Age': [25, 30, 27],
    'Gender' : ['Female', 'Male','Female']
})

In [27]:
df1 # this is a data frame

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Series - Series is a column of a DataFrame or can say it is a list with indices written

In [29]:
type(df1['Name'])

pandas.core.series.Series

In [31]:
df1['Name'] # This is a series

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

# Question No.- (5)

--> Creating a new column

In [38]:
df['Designation'] = pd.DataFrame({
    'Designation' : ['Teacher', 'Engineer', 'Professor']
})

In [39]:
df

     Name  Age  Gender Designation
0   Alice   25  Female     Teacher
1     Bob   30    Male    Engineer
2  Claire   27  Female   Professor

--> Concating two dictionaries

In [49]:
df3 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    index=[0, 1, 2, 3],
)

df4 = pd.DataFrame(
    {
        "A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"],
    },
    index=[0,1,2,3],
)

In [54]:
df5 = pd.concat([df3,df4])

In [67]:
df5

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

--> Resetting indexes in a dataframe

In [74]:
df5.set_index('A') # column A is treated as index

     B   C   D
A
A0  B0  C0  D0
A1  B1  C1  D1
A2  B2  C2  D2
A3  B3  C3  D3
A4  B4  C4  D4
A5  B5  C5  D5
A6  B6  C6  D6
A7  B7  C7  D7

In [80]:
df

     Name  Age  Gender Designation
0   Alice   25  Female     Teacher
1     Bob   30    Male    Engineer
2  Claire   27  Female   Professor

In [82]:
df_temp = pd.DataFrame(df['Name'])

In [84]:
df5['new_col'] = df_temp

--> Joining two data frame

In [86]:
df5

    A   B   C   D new_col
0  A0  B0  C0  D0   Alice
1  A1  B1  C1  D1     Bob
2  A2  B2  C2  D2  Claire
3  A3  B3  C3  D3     NaN
0  A4  B4  C4  D4   Alice
1  A5  B5  C5  D5     Bob
2  A6  B6  C6  D6  Claire
3  A7  B7  C7  D7     NaN

# Question No. - (6)

Series is mutable but only for values , but for size it is immutable

DataFrame is totally mutable as we have seen above in the examples that data frame value and size can be changed 

Panel in pandas is 3D data structure where data and size both are mutable but it is hard to represent it grapihcally

# Question No. - (7)

In [87]:
series1 = pd.Series([4, 7, 4])
series2 = pd.Series(['data', 'science', 'dojo'])
series3 = pd.Series([1.0, 4.0, 7.0])

In [92]:
pd.DataFrame(pd.concat([series1, series2, series3],axis=1))

   0        1    2
0  4     data  1.0
1  7  science  4.0
2  4     dojo  7.0